app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `username` = 'Yanzz'
 LIMIT 1
---
    public function login()
    {
        $session = session();
        $model = new UserModel();
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $user = $model->where('username', $username)->first();

SELECT COUNT(*) AS `numrows`
FROM `notes`
WHERE `user_id` = '1'
SELECT COUNT(*) AS `numrows`
FROM `plans`
WHERE `user_id` = '1'
AND `is_completed` = 0
SELECT *
FROM `notes`
WHERE `user_id` = '1'
ORDER BY `created_at` DESC
 LIMIT 5
SELECT *
FROM `plans`
WHERE `user_id` = '1'
AND `is_completed` = 0
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function dashboard()
    {
        $noteModel = new \App\Models\NoteModel();
        $planModel = new \App\Models\PlanModel();
        $userId = session()->get('id');

        $data['notes_count'] = $noteModel->where('user_id', $userId)->countAllResults();
        $data['plans_count'] = $planModel->where('user_id', $userId)->where('is_completed', 0)->countAllResults(); // hanya yang belum selesai
        $data['recent_notes'] = $noteModel->where('user_id', $userId)->orderBy('created_at', 'DESC')->findAll(5);
        $data['recent_plans'] = $planModel->where('user_id', $userId)->where('is_completed', 0)->orderBy('created_at', 'DESC')->findAll(5);