app/Controllers/NoteController.php

    public function index()
    {
        $model = new NoteModel();
        $userId = session()->get('id');

        $search = $this->request->getVar('search');
        if ($search) {
            $model->groupStart()
                  ->like('title', $search)
                  ->orLike('description', $search)
                  ->groupEnd();
        }

        $sort = $this->request->getVar('sort');
        if ($sort == 'date_asc') {
            $model->orderBy('date', 'ASC');
        } elseif ($sort == 'date_desc') {
            $model->orderBy('date', 'DESC');
        } else {
            $model->orderBy('created_at', 'DESC');
        }

        $data['notes'] = $model->where('user_id', $userId)->paginate(10);
---
SELECT *
FROM `notes`
WHERE `user_id` = '1'
ORDER BY `created_at` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `notes`
WHERE `user_id` = '1'

    public function delete($id)
    {
        $model = new NoteModel();
        $note = $model->find($id);
        if ($note && $note['user_id'] == session()->get('id')) {
            // Hapus file foto
            $photos = [];
            if (!empty($note['photo'])) {
                $decoded = json_decode((string)$note['photo'], true);
                $photos = is_array($decoded) ? $decoded : [];
            }
            foreach ($photos as $photo) {
                if (file_exists('uploads/' . $photo)) unlink('uploads/' . $photo);
            }
            // Hapus file video
            $videos = [];
            if (!empty($note['video'])) {
                $decoded = json_decode((string)$note['video'], true);
                $videos = is_array($decoded) ? $decoded : [];
            }
            foreach ($videos as $video) {
                if (file_exists('uploads/' . $video)) unlink('uploads/' . $video);
            }
            $model->delete($id);

            // Reset auto_increment jika tidak ada data lagi
            $remaining = $model->where('user_id', session()->get('id'))->countAllResults();
---
SELECT *
FROM `notes`
WHERE `notes`.`id` = '3'
DELETE FROM `notes`
WHERE `id` IN ('3')
SELECT COUNT(*) AS `numrows`
FROM `notes`
WHERE `user_id` = '1'