app/Controllers/PlanController.php

SELECT *
FROM `plans`
WHERE `user_id` = '1'
ORDER BY `is_completed` ASC, `date` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `plans`
WHERE `user_id` = '1'
---
     public function index()
    {
        $model = new PlanModel();
        $userId = session()->get('id');

        // Ambil parameter filter status dari query string
        $status = $this->request->getVar('status');
        if ($status === 'completed') {
            $model->where('is_completed', 1);
        } elseif ($status === 'pending') {
            $model->where('is_completed', 0);
        } else {
            // default: tampilkan semua, tapi urutkan yang pending dulu
            $model->orderBy('is_completed', 'ASC');
        }

        $data['plans'] = $model->where('user_id', $userId)->orderBy('date', 'ASC')->paginate(10);

SELECT *
FROM `plans`
WHERE `plans`.`id` = '4'
UPDATE `plans` SET `is_completed` = 1, `updated_at` = '2026-04-28 01:13:11'
WHERE `plans`.`id` IN ('4')
---
    public function complete($id)
    {
        $model = new PlanModel();
        $plan = $model->find($id);
        if ($plan && $plan['user_id'] == session()->get('id')) {
            $model->update($id, ['is_completed' => 1]);